app/Models/CustumModel.php

SELECT COUNT(*) AS `numrows`
FROM `t_vote_vote`
LEFT JOIN `t_choix_cho` ON `t_vote_vote`.`vote_id` = `t_choix_cho`.`vote_id`
LEFT JOIN `t_appreciation_app` ON `t_choix_cho`.`cho_id` = `t_appreciation_app`.`cho_id`
WHERE `t_appreciation_app`.`cho_id` = '35'
AND `t_appreciation_app`.`app_choix` = 'rejeter'
---
    function CountRejeter($choID)
    {
        $builder = $this->db->table('t_vote_vote');
        $builder->join('t_choix_cho', 't_vote_vote.vote_id = t_choix_cho.vote_id', 'left');
        $builder->join('t_appreciation_app', 't_choix_cho.cho_id = t_appreciation_app.cho_id', 'left');
        $builder->where('t_appreciation_app.cho_id', $choID);
        $builder->where('t_appreciation_app.app_choix', 'rejeter');
        $app = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `t_vote_vote`
LEFT JOIN `t_choix_cho` ON `t_vote_vote`.`vote_id` = `t_choix_cho`.`vote_id`
LEFT JOIN `t_appreciation_app` ON `t_choix_cho`.`cho_id` = `t_appreciation_app`.`cho_id`
WHERE `t_appreciation_app`.`cho_id` = '35'
AND `t_appreciation_app`.`app_choix` = 'tMauvais'
---
    function CountTresMauvais($choID)
    {
        $builder = $this->db->table('t_vote_vote');
        $builder->join('t_choix_cho', 't_vote_vote.vote_id = t_choix_cho.vote_id', 'left');
        $builder->join('t_appreciation_app', 't_choix_cho.cho_id = t_appreciation_app.cho_id', 'left');
        $builder->where('t_appreciation_app.cho_id', $choID);
        $builder->where('t_appreciation_app.app_choix', 'tMauvais');
        $app = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `t_vote_vote`
LEFT JOIN `t_choix_cho` ON `t_vote_vote`.`vote_id` = `t_choix_cho`.`vote_id`
LEFT JOIN `t_appreciation_app` ON `t_choix_cho`.`cho_id` = `t_appreciation_app`.`cho_id`
WHERE `t_appreciation_app`.`cho_id` = '35'
AND `t_appreciation_app`.`app_choix` = 'mauvais'
---
    function CountMauvais($choID)
    {
        $builder = $this->db->table('t_vote_vote');
        $builder->join('t_choix_cho', 't_vote_vote.vote_id = t_choix_cho.vote_id', 'left');
        $builder->join('t_appreciation_app', 't_choix_cho.cho_id = t_appreciation_app.cho_id', 'left');
        $builder->where('t_appreciation_app.cho_id', $choID);
        $builder->where('t_appreciation_app.app_choix', 'mauvais');
        $app = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `t_vote_vote`
LEFT JOIN `t_choix_cho` ON `t_vote_vote`.`vote_id` = `t_choix_cho`.`vote_id`
LEFT JOIN `t_appreciation_app` ON `t_choix_cho`.`cho_id` = `t_appreciation_app`.`cho_id`
WHERE `t_appreciation_app`.`cho_id` = '35'
AND `t_appreciation_app`.`app_choix` = 'moyen'
---
    function CountMoyen($choID)
    {
        $builder = $this->db->table('t_vote_vote');
        $builder->join('t_choix_cho', 't_vote_vote.vote_id = t_choix_cho.vote_id', 'left');
        $builder->join('t_appreciation_app', 't_choix_cho.cho_id = t_appreciation_app.cho_id', 'left');
        $builder->where('t_appreciation_app.cho_id', $choID);
        $builder->where('t_appreciation_app.app_choix', 'moyen');
        $app = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `t_vote_vote`
LEFT JOIN `t_choix_cho` ON `t_vote_vote`.`vote_id` = `t_choix_cho`.`vote_id`
LEFT JOIN `t_appreciation_app` ON `t_choix_cho`.`cho_id` = `t_appreciation_app`.`cho_id`
WHERE `t_appreciation_app`.`cho_id` = '35'
AND `t_appreciation_app`.`app_choix` = 'bon'
---
    function CountBon($choID)
    {
        $builder = $this->db->table('t_vote_vote');
        $builder->join('t_choix_cho', 't_vote_vote.vote_id = t_choix_cho.vote_id', 'left');
        $builder->join('t_appreciation_app', 't_choix_cho.cho_id = t_appreciation_app.cho_id', 'left');
        $builder->where('t_appreciation_app.cho_id', $choID);
        $builder->where('t_appreciation_app.app_choix', 'bon');
        $app = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `t_vote_vote`
LEFT JOIN `t_choix_cho` ON `t_vote_vote`.`vote_id` = `t_choix_cho`.`vote_id`
LEFT JOIN `t_appreciation_app` ON `t_choix_cho`.`cho_id` = `t_appreciation_app`.`cho_id`
WHERE `t_appreciation_app`.`cho_id` = '35'
AND `t_appreciation_app`.`app_choix` = 'tBon'
---
    function CountTresBon($choID)
    {
        $builder = $this->db->table('t_vote_vote');
        $builder->join('t_choix_cho', 't_vote_vote.vote_id = t_choix_cho.vote_id', 'left');
        $builder->join('t_appreciation_app', 't_choix_cho.cho_id = t_appreciation_app.cho_id', 'left');
        $builder->where('t_appreciation_app.cho_id', $choID);
        $builder->where('t_appreciation_app.app_choix', 'tBon');
        $app = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `t_vote_vote`
LEFT JOIN `t_choix_cho` ON `t_vote_vote`.`vote_id` = `t_choix_cho`.`vote_id`
LEFT JOIN `t_appreciation_app` ON `t_choix_cho`.`cho_id` = `t_appreciation_app`.`cho_id`
WHERE `t_appreciation_app`.`cho_id` = '35'
AND `t_appreciation_app`.`app_choix` = 'parfait'
---
    function CountParfait($choID)
    {
        $builder = $this->db->table('t_vote_vote');
        $builder->join('t_choix_cho', 't_vote_vote.vote_id = t_choix_cho.vote_id', 'left');
        $builder->join('t_appreciation_app', 't_choix_cho.cho_id = t_appreciation_app.cho_id', 'left');
        $builder->where('t_appreciation_app.cho_id', $choID);
        $builder->where('t_appreciation_app.app_choix', 'parfait');
        $app = $builder->countAllResults();